app/controllers/chapters_controller.rb

	def show
		chapter = Chapter.find params[:chapter_id]
---
SELECT  "chapters".* FROM "chapters" WHERE "chapters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]