app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "james@brown.com"], ["LIMIT", 1]]
---
	def create
		session[:user_id] = nil
		session[:admin_level] = nil
		user = User.find_by_email params[:email]